tests/load-test-artillery.yml
# tests/load-test-artillery.yml
# Artillery load test for TheChattyAI backend
# Simulates 50 concurrent inbound Vapi webhook calls
# Run with: artillery run tests/load-test-artillery.yml

config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 50
      name: "Ramp up to 50 concurrent users"
  payload:
    path: "./tests/load-test-users.csv"
    fields:
      - phone
      - email
      - name
scenarios:
  - flow:
      - post:
          url: "/api/vapi/webhook"
          json:
            type: "end-of-call"
            call:
              id: "{{ $randomString 8 }}-{{ $loopCount }}"
              phoneNumber: "{{ phone }}"
              assistantId: "test-tenant-1"
            transcript:
              text: "My name is {{ name }}, my phone is {{ phone }}, my email is {{ email }}, I want to book a haircut tomorrow at 2pm."
              messages:
                - role: "assistant"
                  text: "What is your name?"
                - role: "user"
                  text: "{{ name }}"
                - role: "assistant"
                  text: "What is your phone number?"
                - role: "user"
                  text: "{{ phone }}"
                - role: "assistant"
                  text: "What is your email?"
                - role: "user"
                  text: "{{ email }}"
                - role: "assistant"
                  text: "What service and time?"
                - role: "user"
                  text: "Haircut tomorrow at 2pm"
            tenantId: "test-tenant-1"